#+TITLE:Manipulate files and data
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:OS Practice CSC 420 Spring 2022
#+STARTUP:overview hideblocks
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:bash :exports both
#+PROPERTY: header-args:bash :results output
** Copying files

   * Copy ~/etc/passwd~ into the current working directory
   * Switch on the verbose option
   * Check that it worked using the wildcard ~pass??~

   #+name: copy_file
   #+begin_src bash
     cd ~/playground
     cp -v /etc/passwd .
     echo "found:" pass??
   #+end_src

   Results:
   #+begin_example
   : '/etc/passwd' -> './passwd'
   : found: passwd

   * Copy ~/etc/passwd~ again, with the verbose and interactive option
   * If you reply ~y~, the file will be overwritten[fn:2]
   * If you reply ~n~, nothing happens
   * List the file with a timestamp to check
   * Use the wildcard class ~pa[[ :lower: ]]~ (without whitespace)

   #+name: copy_warning_y
   #+begin_src bash :cmdline < y.txt
     cd ~/playground
     cp -vi /etc/passwd .
     ls --full-time pa[[:lower:]]*
   #+end_src

   #+RESULTS: copy_warning_y
   : cp: overwrite './passwd'? '/etc/passwd' -> './passwd'
   : -rw-r--r-- 1 pi pi 1992 2022-02-22 07:50:29.311660983 -0600 passwd
   #+end_example

